/*==========================================
  ■■■클래스와 인스턴스 ■■■
============================================*/

// 직사각형 클래스 설계 실습
/*
직사각형의 넓이와 둘레 계산 → 클래스 표현 

클래스의 정체성 → 직사각형
클래스의 속성   → (가로, 세로 이걸 고르겠다) 넓이, 부피, 둘레 ,무게 ,재질, 색.....
클래스의 기능	→ 넓이 계산, 둘레 계산, 가로세로 입력, 결과출력 .....등등

객체를 구성		→ 데이터(속성, 상태) + 기능(동작, 행위)

클래스 설계		→		변수	 +	  메소드

class 직사각형
	//데이터(속성, 상태) → 변수 (순서 의미 없음)
		int 가로, 세로;

	//기능( 동작 ,행위)  → 메소드 (순서 의미 없음)
	가로세로 입력()
	{
	}

	둘레계산()
	{
	}
	
	넓이계산()
	{
	}

	결과 출력()
	{
	}
*/
class Rect
{

}
// ※ 하나의 자바 파일(.java)에 여러개의 클래스(class)를 설계할 수 있을까????
// 가능하다 하지만, 『public class』는 하나만 쓸 수 있다.
// 그리고 저장할때는 public 이 달린 클래스 이름으로 저장해라.
// 일반적으로는 하나의 파일에 하나의 클래스를 설계한다.

// 또한, 여러개의 클래스가 설계된 파일을 컴파일하게 되면
// 내부에 설계된 클래스의 수만큼 클래스 파일(.class)이 파생된다.


public class Test072
{
	public static void main(String[] args)
	{
		
	}

}