/*===========================================
■■■ 연 산 자 (Operater) ■■■
=============================================*/
// 비트 단위 연산

public class Test025
{
	public static void main(String[] agrs)
	{
		int a = 13 ,b = 7;
		int c, d, e;

		c = a & b;
		d = a | b;
		e = a ^ b;

		System.out.printf("a & b = %d%n", c);
		System.out.printf("a | b = %d%n", d);
		System.out.printf("a ^ b = %d%n3", e);
		
		/*
		a & b = 5
		a | b = 15
		a ^ b = 10
		계속하려면 아무 키나 누르십시오 . . .
		*/
	}
}

/*
	a = 00001101
&	b = 00000111
-----------------
        00000101 = 5


	a = 00001101
|	b = 00000111
-----------------
        00001111 = 15

	a = 00001101
^	b = 00000111
-----------------
        00001010 = 10
*/